# InnerVolume Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
EnergyAnalysisSpace..::..InnerVolume Property
EnergyAnalysisSpace Class See Also
---
The analytical volume for this space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double InnerVolume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InnerVolume As Double
	Get
```

Visual C++
---
```text
public:
property double InnerVolume {
	double get ();
}
```

# Remarks
The inner space volume is bounded by the interior surfaces.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace